In [5]:
import pandas as pd
df = pd.read_csv('P:\Pw Skills\Pw Data Science\Pandas\pandas advance\df1.csv')

<>:2: SyntaxWarning: invalid escape sequence '\P'
<>:2: SyntaxWarning: invalid escape sequence '\P'
C:\Users\princ\AppData\Local\Temp\ipykernel_8144\131817981.py:2: SyntaxWarning: invalid escape sequence '\P'
  df = pd.read_csv('P:\Pw Skills\Pw Data Science\Pandas\pandas advance\df1.csv')

ANS.1

1.
head()-- This function is used to return the top n (5 by default) values of a data frame or series.

In [6]:
df.head()

   Unnamed: 0  column_1  column_2  column_3  column_4  column_5  column_6
0           1  0.281065  0.185066  0.377423  0.529215  0.483992  0.802807
1           2  0.146285  0.149122  0.147683  0.317736  0.044780  0.811977
2           3  0.927577  0.485422  0.095311  0.368202  0.847388  0.539634
3           4  0.756482  0.138003  0.237721  0.978085  0.151469  0.919361
4           5  0.184299  0.924552  0.136417  0.761460  0.857694  0.736625

2.
drop()-- Used to drop rows/columns from a dataframe.

In [10]:
df = df.drop('Unnamed: 0',axis=1)

3.
tail()--This method is used to return the bottom n (5 by default) rows of a data frame or series.

In [11]:
df.tail()

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.146285  0.149122  0.147683  0.317736  0.044780  0.811977
2  0.927577  0.485422  0.095311  0.368202  0.847388  0.539634
3  0.756482  0.138003  0.237721  0.978085  0.151469  0.919361
4  0.184299  0.924552  0.136417  0.761460  0.857694  0.736625
5  0.488250  0.319230  0.965487  0.030278  0.592448  0.104112

4.
sample--This method is used to generate a sample random row or column from the data frame.

In [12]:
df.sample()

   column_1  column_2  column_3  column_4  column_5  column_6
2  0.927577  0.485422  0.095311  0.368202  0.847388  0.539634

5.
info()--This method is used to generate the summary of the DataFrame, this will include info about columns with their names, their datatypes, and missing values.

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   column_1  6 non-null      float64
 1   column_2  6 non-null      float64
 2   column_3  6 non-null      float64
 3   column_4  6 non-null      float64
 4   column_5  6 non-null      float64
 5   column_6  6 non-null      float64
dtypes: float64(6)
memory usage: 420.0 bytes

6.
dtypes()--This method returns a Series with the data type of each column.

In [15]:
df.dtypes

column_1    float64
column_2    float64
column_3    float64
column_4    float64
column_5    float64
column_6    float64
dtype: object

7.
shape()--It returns a tuple representing the dimensionality of the Pandas DataFrame.

In [16]:
df.shape

(6, 6)

ANS 2.

In [230]:
df1 = pd.DataFrame(
    {
        'A': [3,8,6,2,9],
        'B': [5,2,9,3,1],
        'C': [1,7,4,5,2]
    }
)

In [231]:
custom_index = pd.Index(range(1,len(df1)*2-1,2))

In [232]:
df1.set_index(pd.Index(range(1,len(df1)*2,2)),inplace=True)

In [233]:
df1

   A  B  C
1  3  5  1
3  8  2  7
5  6  9  4
7  2  3  5
9  9  1  2

ANS3.

In [60]:
df = pd.DataFrame({
    'Values':[10,20,30,40,50]
})

In [61]:
def Add(data):
    sum = 0
    for i in range(0,3):
        sum = sum + data['Values'][i]
    print(sum)

In [62]:
Add(df)

60

Ans4.

In [130]:
df = pd.DataFrame(
    {
        'Text':['My name is Prince Singh','I am an Working Professional','I work in Consulting Company']
    })

In [131]:
def count(data):
    Word_count = []
    for i in data.columns:
        lst = []
        for j in i.split():
             lst.append(j)
        Word_count.append(len(lst))
    return Word_count

Word_count = pd.Series(Word_count)

In [134]:
df['Word_count'] = Word_count

In [135]:
df

                           Text  Word_count
0       My name is Prince Singh           5
1  I am an Working Professional           5
2  I work in Consulting Company           5

Ans5.

DataFrame.size: Returns the total number of elements in the DataFrame (rows * columns). It's an integer.

DataFrame.shape: Returns a tuple with the number of rows and columns in the DataFrame (rows, columns).

Ans6.

In [ ]:
pd.read_excel()

Ans7.

In [136]:
df = pd.DataFrame(
    {
        'Email':['prince.singh@du.com','naman.kapahi@du.com','shweta.jakhar@du.com']
    }
)

In [137]:
df

                  Email
0   prince.singh@du.com
1   naman.kapahi@du.com
2  shweta.jakhar@du.com

In [152]:

def user_name(data,column_name):
    Username = []
    for email in data[column_name]:
        username = email.split('@')[0]
        Username.append(username)
    return pd.Series(Username)

In [154]:
df['Username'] = user_name(df,'Email')

In [155]:
df

                  Email       Username
0   prince.singh@du.com   prince.singh
1   naman.kapahi@du.com   naman.kapahi
2  shweta.jakhar@du.com  shweta.jakhar

Ans8.

In [177]:
df = pd.DataFrame(
    {
        'A':[3,8,6,2,9],
        'B':[5,2,9,3,1],
        'C':[1,7,4,5,2]
    }
)

In [158]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [171]:
def new_df(data,column1,column2,condition1,condition2):
   df1 = data[(condition1(data[column1]))&(condition2(data[column2]))]
   return df1

In [173]:
new_df(df,'A','B',lambda x:x>5,lambda y:y<10).dtypes

A    int64
B    int64
C    int64
dtype: object

Ans9.

In [180]:
df = pd.DataFrame(
    {
        'Values':[1,2,3,4,5,6,7,8]
    }
)

In [181]:
def summary(data,column):
    mean = data[column].mean()
    median = data[column].median()
    std = data[column].std()

    return mean, median, std

In [184]:
mean_val,median_val,std_dev = summary(df,'Values')

Ans10.

In [201]:
import numpy as np
np.random.seed(42)
date_rng = pd.date_range(start='2022-01-01', end='2022-03-31', freq='D')
data = np.random.randint(30, 70, size=(len(date_rng)))
df = pd.DataFrame({'Date': date_rng, 'Values': data})

In [204]:
def moving_avg(data,column,window_size):
    df['Moving_Average'] = df[column].rolling(window=window_size).mean()
    return df

In [206]:
moving_avg(df,'Values',7).head(10)

        Date  Values  Moving_Average
0 2022-01-01      68             NaN
1 2022-01-02      58             NaN
2 2022-01-03      44             NaN
3 2022-01-04      37             NaN
4 2022-01-05      50             NaN
5 2022-01-06      68             NaN
6 2022-01-07      48       53.285714
7 2022-01-08      52       51.000000
8 2022-01-09      40       48.428571
9 2022-01-10      40       47.857143

Ans11.

In [210]:
df = pd.DataFrame(
    {
        'Date':pd.to_datetime(['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05'])
    }
)

In [215]:
def day(data):
    df['Weekday'] = df['Date'].dt.day_name()

    return df

In [216]:
day(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Ans12.

In [219]:
df = pd.DataFrame(
    {
        'Date':pd.to_datetime(['2022-12-30','2023-01-15','2023-01-25','2023-02-05','2023-01-10'])
    }
)

In [223]:
df

        Date
0 2022-12-30
1 2023-01-15
2 2023-01-25
3 2023-02-05
4 2023-01-10

In [228]:
def filtered_date(data):
    data = data[(data['Date']>='2023-01-01') & (data['Date']<='2023-01-31')]
    return data

In [229]:
filtered_date(df)

        Date
1 2023-01-15
2 2023-01-25
4 2023-01-10

Ans13.

In [ ]:
import pandas as pd